
//Release 0: Напишите функцию, возвращающую массив из 'numWords' случайно сгенерированных слов.
// Если в функцию не передается значение numWords, то по умолчанию должно генерироваться 5 слов.
function randomWords(numWords) {
	// Пишите код здесь.
}

//Release 1: Найдите самое длинное слово в массиве.
function maxWordLength(wordsArray) {
	// Пишите код здесь.
}

//Release 2: Проверьте, есть ли ключ(key) в переданном объекте(obj).
function checkObj(key, obj) {
		// Пишите код здесь.
}

//Release 3: Напишите функцию, которая принимает на вход слово типа "строка",
// и возвращает его задом наперед, то есть инвертированное. Например: программист -> тсиммаргорп

function reverse(word) {
	// Пишите код здесь.
}

// Теперь сделайте эту функцию "стрелочной" (Arrow function).
// Пишите код здесь.
