// Release 0: Массивы. Есть 2 массива: arrayOfNames - с именами, arrayOfColors - с цветами.
// Надо получить объект coloredNames следующего вида: {<имя-1>: <цвет-1>, <имя-2>: <цвет-2>, <имя-3>: <цвет-3>}
// Использовать цикл.
const arrayOfNames=["Bill","Anna","Peter"];
const arrayOfColors=["Red","Blue","Pink"];
let coloredNames={}

// Пишите код здесь.


// Release 1: Заполните конструктор класса Машина. Добавьте Машине метод 'beep'.
// Объявите 3 объекта машины с разными параметрами.
class Car {
	constructor(brand, color, type) {
		// Пишите код здесь.
	}
};
// И здесь.

// Release 2: Работаем с Date().
// Напишите функцию, которой на вход будет подаваться ваша дата рождения,
// а на выходе она будет выдавать ваш возраст.
// Если параметр inSeconds равен true, то возраст выдается в секундах. Иначе округляем до количества лет.
function getAge(birthDate, inSeconds) {
	// Пишите код здесь.
}